In [1]:
# jupyter is an open source web app born out of the ipython project and built to support many programming languages other than python
# dataFrame in pandas is an object that holds the data that we are going to analyze

In [2]:
import pandas

In [3]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 23, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']])
print(type(d))

<class 'pandas.core.frame.DataFrame'>

In [4]:
d

        0   1         2
0    Andy  46  Engineer
1    Jane  23     Nurse
2  Robert  21   Student
3   Maria  30   Student

In [5]:
d = pandas.DataFrame([['Andy', 46, 'Engineer'], ['Jane', 23, 'Nurse'], ['Robert', 21, 'Student'], ['Maria', 30, 'Student']], 
                    columns = ['Name', 'Age', 'Occupation'], # rename the column labels
                    index = ['ID1','ID2','ID3','ID4'] # rename the index labels
                    )
d

       Name  Age Occupation
ID1    Andy   46   Engineer
ID2    Jane   23      Nurse
ID3  Robert   21    Student
ID4   Maria   30    Student

In [6]:
d.Name # print by its column label

ID1      Andy
ID2      Jane
ID3    Robert
ID4     Maria
Name: Name, dtype: object

In [7]:
d.Age

ID1    46
ID2    23
ID3    21
ID4    30
Name: Age, dtype: int64

In [8]:
d.Occupation

ID1    Engineer
ID2       Nurse
ID3     Student
ID4     Student
Name: Occupation, dtype: object

In [9]:
type(d.Occupation) # return data by its column label would have SERIES data type

pandas.core.series.Series

In [10]:
d.Age.min()

21

In [11]:
d.Name.max() # max alphabetically

'Robert'

In [12]:
d.min() # find min value per column, can come from different index

Name              Andy
Age                 21
Occupation    Engineer
dtype: object